#include "OLED_device.h"





//==================================================================
//函 数 AddDisplayDevices
//功    能：注册多个显示设备，将其加入到链表中
//输入参数：
//返 回 值：
//日    期：
//版    本：
//==================================================================
void AddDisplayDevices()
{
	AddDisplayDeviceOLED();//注册OLED
}


//==================================================================
//函 数：GetDisplayDevice
//功    能：根据名字获得显示结构体指针
//输入参数：名字
//返 回 值：pDisplayDevice
//日    期：2024/04/29
//版    本：
//==================================================================
pDisplayDevice GetDisplayDevice(char *name)
{
	return __GetDisplayDevice;
}


